---
kind: method
id: M:Autodesk.Revit.DB.Structure.Rebar.IsHookLengthOverrideEnabled
zh: 钢筋、配筋
source: html/489db44d-08a8-600c-a139-29947eea09ef.htm
---
# Autodesk.Revit.DB.Structure.Rebar.IsHookLengthOverrideEnabled Method

**中文**: 钢筋、配筋

Returns True if the ability to override hook lengths is enabled for this rebar instance, False otherwise.

## Syntax (C#)
```csharp
public bool IsHookLengthOverrideEnabled()
```